exercicio/app/controllers/atividades_controller.rb

INSERT INTO "atividades" ("created_at", "data", "tempo", "tipo", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 02 Nov 2013 14:58:40 UTC +00:00], ["data", Sat, 02 Nov 2013], ["tempo", 12], ["tipo", "asdf"], ["updated_at", Sat, 02 Nov 2013 14:58:40 UTC +00:00]]
---
  def create
  	atividade = Atividade.new params[:atividade]

  	if atividade.save

SELECT "atividades".* FROM "atividades" WHERE "atividades"."id" = ? LIMIT 1  [["id", "10"]]
---
  def edit
  	@atividade = Atividade.find params[:id]

SELECT "atividades".* FROM "atividades" WHERE "atividades"."id" = ? LIMIT 1  [["id", "11"]]
UPDATE "atividades" SET "tempo" = 112, "tipo" = 'catreva', "updated_at" = '2013-11-02 17:54:36.107511' WHERE "atividades"."id" = 11
---
  def update
  	atividade = Atividade.find params[:id]
  	if atividade.update_attributes params[:atividade]

SELECT "atividades".* FROM "atividades" WHERE "atividades"."id" = ? LIMIT 1  [["id", "11"]]
---
  def delete
  	@atividade = Atividade.find(params[:id])

SELECT "atividades".* FROM "atividades" WHERE "atividades"."id" = ? LIMIT 1  [["id", "11"]]
DELETE FROM "atividades" WHERE "atividades"."id" = ?  [["id", 11]]
---
  def destroy
  	atividade = Atividade.find(params[:id])
  	if atividade.destroy