exercicio/app/controllers/exercicio_controller.rb

  def principal
  	@atividades = Atividade.all
---
SELECT "atividades".* FROM "atividades"